Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/ruby-omegat.tmx
Source language: en_us
Languages: pt_br

source: default values
pt_br: valores padrões

source: Cannot change signature.
pt_br: Não pode mudar a assinatura.

source: Constructor with the same signature already exists in class {0}.
pt_br: Um construtor com a mesma assinatura já existe na classe {0}.

source: You have to provide values for the new parameters.
pt_br: Você deve fornecer valores para os novos parâmetros.

source: Duplicate parameter name ({0}).
pt_br: Nome para parâmetro duplicado ({0}).

source: Name "{0}" is already used as a name of local variable.
pt_br: O nome "{0}" está em uso como um nome de variável local.

source: Cannot change modifiers of method in interface.
pt_br: Não é possível alterar modificadores do método de uma interface.

source: You changed the access modifier to {0}.
pt_br: Você alterou o modificador de acesso para {0}.

source: Method will not be accessible for some of references.
pt_br: O método não estará acessível para algumas referências.

source: The sources will not compile after refactoring!
pt_br: Os códigos não serão compilados depois da refatoração!

source: Cannot change parameters of this object.
pt_br: Não é possível alterar parâmetros deste objeto.

source: A method or the constructor has to be selected.
pt_br: Um método deste construtor deve estar selecionado.

source: You have not selected anything to find.
pt_br: Você não selecionou nada para pesquisar.

source: Select Find Usages, Find Overriding Methods, or both.
pt_br: Selecione Encontrar utilizações, Encontrar métodos sobrescritos ou ambos.

source: Cannot refactor read-only file "{0}"
pt_br: Impossível refatorar o arquivo somente leitura "{0}"

source: Parse error in file which contains {0} reference - skipping it
pt_br: Erro de análise no arquivo o qual contém a referência {0} - ignorando isto

source: Change comment
pt_br: Alterar comentário

source: Rename method definition
pt_br: Renomar definição de método

source: Update method call
pt_br: Atualizar chamada de método

source: Rename symbol
pt_br: Renomear símbolo

source: Rename class definition
pt_br: Renomear definição de classe

source: Rename module definition
pt_br: Renomear definição de módulo

source: Rename local variable
pt_br: Renomear variável local

source: Rename dynamic variable
pt_br: Renomear variável dinâmica

source: Rename global variable reference
pt_br: Renomear referência da variável global

source: Rename instance variable reference
pt_br: Renomear referência da variável de instância

source: Rename class variable reference
pt_br: Renomear referência da variável de classe

source: Update reference to {0}
pt_br: Atualizar referência para {0}

source: Rename parameter
pt_br: Renomear parâmetro

source: Apply Rename on &Comments
pt_br: Renomear também ocorrências em &comentários

source: Change Method &Parameters...
pt_br: Modificar &parâmetros do método...

source: Change Method Parameters
pt_br: Modificar parâmetros do método

source: Rename <b>{0}</b> to <b>{1}</b>
pt_br: Renomear de <b>{0}</b> para <b>{1}</b>

source: Fi&nd Usages
pt_br: &Encontrar ocorrências

source: Find Usages
pt_br: Encontrar ocorrências

source: Usages of <b>{0}</b>
pt_br: Ocorrências de <b>{0}</b>

source: Usages
pt_br: Ocorrências

source: Overriding Methods
pt_br: Sobreescrevendo métodos

source: Search From Base Class
pt_br: Procurar a partir da classe base

source: Find All SubTypes of <b>{0}</b>
pt_br: Encontrar todos os subtipos de <b>{0}</b>

source: Find Direct SubTypes of <b>{0}</b>
pt_br: Encontrar subtipos diretos de <b>{0}</b>

source: Ruby refactoring is approximate.
pt_br: Refatoração do Ruby é aproximada.

source: Review all changes.
pt_br: Revisar todas as alterações.

source: of <b>{0}</b>
pt_br: de <b>{0}</b>

source: and
pt_br: e

source: Encapsulate &Fields...
pt_br: &Encapsular campos...

source: Encapsulate Fields
pt_br: Encapsular campos

source: Encapsulate fields in class <b>{0}</b>
pt_br: Encapsular campos na classe <b>{0}</b>

source: Move source to package "{0}"
pt_br: Mover o código para o pacote "{0}"

source: Move "{0}" to package "{1}"
pt_br: Mover "{0}" para o pacote "{1}"

source: Move to "{0}" package
pt_br: Mover para o pacote "{0}"

source: Add import {0}
pt_br: Adicionar import {0}

source: Remove import {0}
pt_br: Remover import {0}

source: Move &Class...
pt_br: Mover &Classe...

source: Move Package...
pt_br: Mover pacote...

source: Move Class
pt_br: Mover Classe

source: Class was moved into another package and refactoring is necessary.
pt_br: A classe foi movida para outro pacote e a refatoração é necessária.

source: Multiple classes were moved into another package and refactoring is necessary.
pt_br: Várias classes foram movidas para outro pacote e a refatoração é necessária.

source: Move Classes
pt_br: Mover Classes

source: Move listed classes
pt_br: Mover classes listadas

source: Move Package
pt_br: Mover pacote

source: U&ndo
pt_br: &Desfazer

source: Red&o
pt_br: &Refazer

source: Move class <b>{0}</b> to <b>{1}</b> package
pt_br: Mover classe do pacote <b>{0}</b> para <b>{1}</b>

source: Move package <b>{0}</b> to <b>{1}</b> package
pt_br: Mover pacote de <b>{0}</b> para <b>{1}</b>

source: Move class {0}
pt_br: Mover classe {0}

source: List of &Classes:
pt_br: Lista de &classes:

source: Move package {0}
pt_br: Mover pacote {0}

source: &To Package:
pt_br: &Para pacote:

source: Package "{0}" is located in more than one project.
pt_br: O pacote "{0}" está localizado em mais de um projeto.

source: Please, select the desired package in the Package Chooser.
pt_br: Por favor, selecione o pacote desejado na seleção de pacotes.

source: Cannot proceed.
pt_br: Não pôde continuar.

source: Package "{0}" is located only in read-only projects.
pt_br: O pacote "{0}" está localizado apenas em projetos somente leitura.

source: A package corresponding to the entered name cannot be found.
pt_br: Um pacote com o nome digitado não pôde ser encontrado.

source: NEEDS REFRESH
pt_br: REQUER ATUALIZAÇÃO

source: Open In Navigator
pt_br: Abrir no Navegador

source: &New Name:
pt_br: &Novo nome:

source: occurrence
pt_br: ocorrência

source: occurrences
pt_br: ocorrências

source: errors
pt_br: erros

source: Cannot rename here
pt_br: Impossível renomear aqui

source: Cannot find usages here
pt_br: Impossível encontrar ocorrências aqui

source: &lt;anonymous class&gt;
pt_br: &lt;classe anônima&gt;

source: &lt;initializer&gt;
pt_br: &lt;inicializador&gt;

source: Field
pt_br: Campo

source: Constructor
pt_br: Construtor

source: Local Variable
pt_br: Variável local

source: Folder
pt_br: Pasta

source: Package
pt_br: Pacote

source: Class
pt_br: Classe

source: <html>Method <b>{0}</b> of class <b>{1}</b>:</html>
pt_br: <html>Método <b>{0}</b> da classe <b>{1}</b>:</html>

source: <html>Class <b>{0}</b>:</html>
pt_br: <html>Classe <b>{0}</b>:</html>

source: <html>Constructor <b>{0}</b> of class <b>{1}</b>:</html>
pt_br: <html>Construtor <b>{0}</b> da classe <b>{1}</b>:</html>

source: <html>Field <b>{0}</b> of class <b>{1}</b>:</html>
pt_br: <html>Campo <b>{0}</b> da classe <b>{1}</b>:</html>

source: <html>Package <b>{0}</b>:</html>
pt_br: <html>Pacote <b>{0}</b>:</html>

source: <html>Variable <b>{0}</b>:</html>
pt_br: <html>Variável <b>{0}</b>:</html>

source: Type
pt_br: Tipo

source: Default Value
pt_br: Valor padrão

source: Original Index
pt_br: Índice original

source: Used
pt_br: Usado

source: Access Modifier:
pt_br: Modificador de acesso:

source: Method Signature Preview
pt_br: Visualizar assinatura do método

source: Add
pt_br: Adicionar

source: Move Up
pt_br: Mover acima

source: Move Down
pt_br: Move abaixo

source: D
pt_br: B

source: Change parameters of <b>{0}</b> {1} to <b>{2}</b>
pt_br: Modificar parâmetros de <b>{0}</b> {1} para <b>{2}</b>

source: method
pt_br: método

source: constructor
pt_br: construtor

source: package private
pt_br: pacote privado

source: Create Getter
pt_br: Criar Getter

source: Create Setter
pt_br: Criar Setter

source: &List of Fields to Encapsulate:
pt_br: &Lista de campos para encapsular:

source: Fields' &Visibility:
pt_br: Visibilidade dos &campos:

source: &Accessors' Visibility:
pt_br: Visibilid&ade dos métodos:

source: &Use Accessors Even When Field Is Accessible
pt_br: &Utilizar método de acesso uniforme quando o campo é acessível

source: Extract Method
pt_br: Extrair método

source: Extract &Method...
pt_br: Extrair &método...

source: &Access
pt_br: &Acesso

source: Pa&rameters:
pt_br: Pa&râmetros:

source: &Method Name:
pt_br: Nome do &método:

source: &Declare Static
pt_br: &Declarar como static

source: The following warnings and errors were found.
pt_br: Os seguintes erros e avisos foram encontrados.

source: You can continue only with warnings.
pt_br: Você só pode continuar se tiver apenas avisos.

source: &List of Errors
pt_br: &Lista de erros

source: Warning
pt_br: Aviso

source: P&roject:
pt_br: &Projeto:

source: &Location:
pt_br: &Local:

source: Find &Usages
pt_br: &Encontrar ocorrências

source: Find &Overriding Methods
pt_br: Encontrar método &sobreescritos

source: &Search from Base Class [{0}]
pt_br: &Pesquisar a partir da classe base [{0}]

source: Find &All Subtypes
pt_br: Encontrar &todos os subtipos

source: Find &Direct Subtypes Only
pt_br: Encontrar &apenas subtipos diretos

source: Refactoring
pt_br: Refatorando

source: Add parameter
pt_br: Adicionar parâmetro

source: Type new name
pt_br: Digite o novo nome

source: Destination Supertype
pt_br: Destino do supertipo

source: Members To Pull Up
pt_br: Membros para retirar

source: Select members to Pull Up
pt_br: Selecione os membros para retirar

source: Members To Push Down
pt_br: Membros para colocar

source: Select members to Push Down
pt_br: Selecione os membros para colocar

source: Declare Field For Current Outer Class
pt_br: Declarar campos para a classe externa atua

source: Inner Class Name
pt_br: Nome da classe interna

source: Declare Static
pt_br: Declarar como static

source: Interface Name
pt_br: Nome da interface

source: Members To Extract
pt_br: Membros para extrair

source: Members To Extract Description
pt_br: Descrição dos membros para extrair

source: Superclass Name
pt_br: Nome da superclasse

source: Superclass name
pt_br: Nome da superclasse

source: Supertype To Use
pt_br: Supertipo para utilizar

source: Select Supertype to Use
pt_br: Selecione o supertipo para utilizar

source: This Class:
pt_br: Esta classe:

source: <default package>
pt_br: <pacote padrao>

source: Search in &Comments
pt_br: Pesquisar em &comentários

source: Find Usages Results
pt_br: Encontrar resultados das ocorrências

source: Refactoring Preview
pt_br: Visualizar refatoração

source: &Rename Without Refactoring
pt_br: &Renomear sem refatorar

source: &Move Without Refactoring
pt_br: &Mover sem refatorar

source: &lt;not available&gt;
pt_br: &lt;nao disponivel&gt;

source: Safe Delete
pt_br: Exclusão segura

source: Delete element(s) and keep references to them, if any.
pt_br: Excluir elemento(s) e manter referências a eles, se houver...

source: Delete classes and and keep references to them, if any.
pt_br: Excluir classes e manter referências a elas, se houver.

source: Delete method <b>{0}</b> and keep references to that method, if any.
pt_br: Excluir método <b>{0}</b> e manter referências para este método, se houver.

source: Delete methods and keep keep references to them, if any.
pt_br: Excluir métodos e manter referências para eles, se houver.

source: There are references to <b>{0}</b>.
pt_br: Existem referências para <b>{0}</b>.

source: Delete
pt_br: Excluir

source: <html>Safely delete multiple elements &nbsp;(&nbsp;<b>{0}</b> &nbsp;, <br> <b>{1}</b> &nbsp;...&nbsp;).</html>
pt_br: <html>Exclusão segura de múltiplos elementos &nbsp;(&nbsp;<b>{0}</b> &nbsp;, <br> <b>{1}</b> &nbsp;...&nbsp;).</html>

source: <html>Safely delete <b>{0}</b>.</html>
pt_br: <html>Exclusão segura de <b>{0}</b>.</html>

source: &Search In Comments
pt_br: Pe&squisar em comentários

source: <html>Warning: Attempting to delete <b>{0}</b> from a reference.</html>
pt_br: <html>Aviso: Tente excluir <b>{0}</b> de uma referência.</html>

source: <html>Safely delete constructor <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do construtor <b>{0}</b> da classe <b>{1}</b>.</html>

source: <html>Safely delete variable <b>{0}</b>.</html>
pt_br: <html>Exclusão segura da variável <b>{0}</b>.</html>

source: <html>Safely delete method <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do método <b>{0}</b> da classe <b>{1}</b>.</html>

source: <html>Safely delete field <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do campo <b>{0}</b> da classe <b>{1}</b>.</html>

source: Extract Interface
pt_br: Extrair interface

source: Extract Interface <b>{0}</b>
pt_br: Extrair interface <b>{0}</b>

source: Extract &Interface...
pt_br: Extrair &interface...

source: Extract Interface - {0}
pt_br: Extrair interface - {0}

source: Interface &Name:
pt_br: &Nome da interface:

source: &Members to Extract:
pt_br: &Membros para extrair:

source: Member
pt_br: Membro

source: Extract Superclass
pt_br: Extrair superclasse

source: Extract Superclass <b>{0}</b>
pt_br: Extrair superclasse <b>{0}</b>

source: &Extract Superclass...
pt_br: &Extrair superclasse...

source: Extract Superclass - {0}
pt_br: Extrair superclasse - {0}

source: Superclass &Name:
pt_br: &Nome da superclasse:

source: Make Abstract
pt_br: Tornar abstrato

source: Pull Up
pt_br: Retirar

source: Pull Up Members Of <b>{0}</b>
pt_br: Retirar membros de <b>{0}</b>

source: Pull &Up...
pt_br: &Retirar...

source: Destination &Supertype:
pt_br: Destino do &supertipo:

source: Pull Up Members of "{0}"
pt_br: Retirar membros de "{0}"

source: &Members to Pull Up:
pt_br: &Membros a serem retirados:

source: Push Down
pt_br: Colocar

source: Push Down Members Of <b>{0}</b>
pt_br: Colocar membros a partir de <b>{0}</b>

source: Push &Down...
pt_br: &Colocar...

source: Push Down Members of "{0}"
pt_br: Colocar membros a partir de "{0}"

source: &Members to Push Down:
pt_br: &Membros a serem colocados:

source: Keep Abstract
pt_br: Manter abstrato

source: Convert &Anonymous Class to Inner...
pt_br: Converter &classe anônima para classe interna...

source: Convert Anonymous Class to Inner
pt_br: Converter classe anônima para classe interna

source: Inner Class &Name:
pt_br: &Nome da classe interna:

source: Declare &Static
pt_br: Declarar como &static

source: &Constructor Parameters:
pt_br: Parâmetros do &construtor:

source: Use Supertype Where Possible
pt_br: User supertipo onde possível

source: Use Supertype Where Possible - {0}
pt_br: Usar supertipo onde possível - {0}

source: Use Supertype &Where Possible...
pt_br: Usar supertipo &onde possível...

source: &Supertype to Use:
pt_br: &Supertipo para utilizar:

source: &Apply Rename on Comments
pt_br: Renome&ar também ocorrências em comentários

source: Move Inner to Outer Level
pt_br: Mover de nível interno para externo

source: Move <b>{0}</b> to Outer Level
pt_br: Mover <b>{0}</b> para nível externo

source: Move Inner to Outer &Level...
pt_br: Mover de interno para nível externo...

source: &Class Name:
pt_br: Nome da &classe:

source: Move "{0}" to Outer Level
pt_br: Mover "{0}" para nível externo

source: &Declare Field for the Current Outer Class
pt_br: &Declarar campo para a classe externa atual

source: Field Name:
pt_br: Nome do campo:

source: Copy Class
pt_br: Copiar classe

source: Copy Class <b>{0}</b>
pt_br: Copiar classe <b>{0}</b>

source: &Copy Without Refactoring
pt_br: &Copiar sem aplicar refatoração

source: Rename file, class, and constructors to {0}
pt_br: Renomear arquivo, classe e construtores para {0}

source: Rename class and constructors to {0}
pt_br: Renomear classe e construtores para {0}

source: Rename method to {0}
pt_br: Renomear método para {0}

source: Rename field to {0}
pt_br: Renomear campo para {0}

source: Rename parameter to {0}
pt_br: Renomear parâmetro para {0}

source: Rename local variable to {0}
pt_br: Renomear variável local para {0}

source: Rename attribute to {0}
pt_br: Renomear atributo para {0}

source: Rename type parameter to {0}
pt_br: Renomear tipo do parâmetor para {0}

source: Rename enumeration to {0}
pt_br: Renomear enumeração para {0}

source: Rename annotation type to {0}
pt_br: Renomear tipo da anotação para {0}

source: Rename folder "{0}" to "{1}"
pt_br: Renomear pasta "{0}" para "{1}"

source: Change {0} parameters of {1}
pt_br: Alterar {0} parâmetros de {1}

source: Ruby Java Integration
pt_br: Integração Java Ruby

source: Support for accessing Java Libraries via JRuby in Ruby projects
pt_br: Suporte para acessar bibliotecas Java via JRuby em projetos Ruby

source: Project Properties - {0}
pt_br: Propriedades do projeto - {0}

source: &Java Platform:
pt_br: Plataforma &Java:

source: &Manage Platforms...
pt_br: Gerenciar platafor&mas...

source: Add JAR/Folder
pt_br: Adicionar JAR/Diretório

source: Classpath Entry (folder, ZIP or JAR file)
pt_br: Entrada do classpath (diretório, ZIP ou arquivo JAR)

source: Classpath for Compiling Sources
pt_br: Classpath para compilação do código-fonte

source: Classpath for Compiling Tests
pt_br: Classpath para compilação dos testes

source: Classpath for Running Project`
pt_br: Classpath para execução do projeto`

source: Classpath for Running Tests
pt_br: Classpath para execução dos testes

source: Compiled Sources
pt_br: Códigos-fonte compilados

source: Compiled Tests
pt_br: Testes compilados

source: Add Library
pt_br: Adicionar biblioteca

source: Missing library: {0}
pt_br: Faltando biblioteca: {0}

source: Missing project: {0}
pt_br: Faltando projeto: {0}

source: Broken reference: {0}
pt_br: Referência inválida: {0}

source: Opens the Java Platform Manager.
pt_br: Abrir gerenciador de plataforma Java.

source: Lists all of the items on the Classpath for Compiling Sources.
pt_br: Lista de todos os itens no classpath para compilação de códigos-fonte.

source: Opens the Project chooser, where you can add a project to the classpath.
pt_br: Abre o seletor de projetos, onde você pode adicionar um projeto para o classpath.

source: Open Add Library Dialog
pt_br: Abrir diálogo de Adicionar bibliotecas

source: Opens the JAR file chooser, where you can add a JAR file to the classpath.
pt_br: Abre o seletor de arquivo JAR, onde você pode adicionar um arquivo JAR para o classpath.

source: Removes the selected item from the classpath.
pt_br: Remove o item selecionado do classpath.

source: Moves the selected item forward in the list of classpath items.
pt_br: Move o item selecionado adiante na lista de itens do classpath.

source: Moves the selected item back in the list of classpath items.
pt_br: Move o item selecionado para trás na lista de itens do classpath.

source: JRuby Class Path
pt_br: Caminho de classe JRuby

source: Add &Project...
pt_br: Adicionar &projeto...

source: Add &Library...
pt_br: Adicionar bib&lioteca...

source: Add JAR/&Folder
pt_br: Adicionar JAR/&Diretório

source: &Edit
pt_br: &Editar

source: &Remove
pt_br: &Remover

source: Move &Up
pt_br: Mover a&cima

source: Move &Down
pt_br: Mover a&baixo

source: Run-&time Libraries:
pt_br: Bibliotecas de &tempo de execução:

source: &Build Projects on Classpath
pt_br: C&onstruir projetos no classpath

source: &Include Java (Requires Restart)
pt_br: &Incluir Java (requer reinicialização)

source: When selected, code completion, go to declaration etc. will include Java classes and Ruby to Java integration APIs
pt_br: Quando selecionado, auto-completar de código-fonte, ir para declaração etc. irão incluir classes Java e Ruby para APIs de integração do Java

source: Name and Location
pt_br: Nome e local

source: Project &Name:
pt_br: &Nome do projeto:

source: Project &Location:
pt_br: &Local do projeto:

source: Br&owse...
pt_br: Pr&ocurar...

source: Project Fol&der:
pt_br: &Diretório do projeto:

source: Project Folder already exists and is not empty.
pt_br: O diretório do projeto já existe e não está vazio.

source: Project Folder is not a valid path.
pt_br: O diretório do projeto não tem um caminho válido.

source: Project Folder cannot be created.
pt_br: O diretório do projeto não pode ser criado.

source: Project Name is not a valid folder name.
pt_br: O nome do projeto não é um nome válido para diretório.

source: Sample Depot Application project from the book Agile Web Development with Rails, 2nd Edition, published by the Pragmatic Bookshelf.
pt_br: Aplicação de exemplo 'Depot' do livro Agile Web Development with Rails, 2nd Edition, publicado por Pragmatic Bookshelf.

source: Depot Sample Application.
pt_br: Aplicação de exemplo 'Depot'.

source: Depot Sample
pt_br: Exemplo 'Depot'

source: Depot Sample Application
pt_br: Aplicação de exemplo 'Depot'

source: Depot Application
pt_br: Aplicação 'Depot'

source: JRuby Implementation
pt_br: Implementação JRuby

source: The actual JRuby implementation
pt_br: A implementação atual do JRuby

source: Ruby Hints
pt_br: Dicas Ruby

source: Additional source code hints for Ruby
pt_br: Dicas adicionais no código-fonte para Ruby

source: General
pt_br: Geral

source: Block variable aliases local variable - Unintentional side effect?
pt_br: Variável de bloco aponta para variável local - Produz efeito não desejado?

source: The block variable has the same name as a local variable, so it will reuse (and modify)the local variable which is sometimes not intended
pt_br: A variável de bloco tem o mesmo nome da variável local, então será reutilizada (e modificada) a variável local a qual, em alguns casos, não está indentada.

source: Rename the block variable
pt_br: Renomear bloco de variável

source: Rename the local variable
pt_br: Renomar a variável local

source: Rails Deprecations
pt_br: Descontinuações do Rails

source: Identifies deprecated Rails constructs; see http://www.rubyonrails.org/deprecation
pt_br: Identifica construtor Rails obsoleto; veja http://www.rubyonrails.org/deprecation

source: Rails Deprecation: Use the {1} method instead of working with the {0} instance variable directly
pt_br: Descontinuação do Rails: Utilize o método {1} para trabalhar com a variável de instância {0} diretamente

source: {0} is deprecated in Rails, use {1}
pt_br: {0} está obsoleto no Rails, utilize {1}

source: Code block on single line
pt_br: Bloco de código em linha única

source: Code blocks on a single line can optionally be reformatted to span multiple lines
pt_br: Blocos de códigos em linha única pode, opcionalmente, ser reformatado para expandir linhas múltiplas

source: Reformat {0} code block to span multiple lines
pt_br: Reformartar bloco de código {0} para expandir em múltiplas linhas

source: Ruby Compiler Errors
pt_br: Erros do compilador Ruby

source: Hints
pt_br: Dicas

source: Hints And Warinings for Ruby Code
pt_br: Dicas e avisos para código Ruby

source: &Show As:
pt_br: &Exibir como:

source: Show In &Problem Window
pt_br: Mostrar na janela de &Problemas

source: Options
pt_br: Opções

source: Description:
pt_br: Descrição

source: Warning on Current Line
pt_br: Aviso na linha atual

source: Disable this hint
pt_br: Desabilitar esta dica

source: Ruby Editing
pt_br: Edição Ruby

source: Ruby Files
pt_br: Arquivos Ruby

source: Ruby Quoted Strings
pt_br: Strings Ruby citadas

source: Ruby Strings
pt_br: Strings Ruby

source: Ruby Comments
pt_br: Comentários Ruby

source: Reformat Paragraph
pt_br: Reformatar parágrafo

source: Cannot rename this symbol; only parameters, local and dynamic variables are allowed
pt_br: Não pode renomear este símbolo; somente parâmetros, variáveis locais e dinâmicas são permitidas

source: Cannot rename when source contains errors
pt_br: Não pode renomear quando o código-fonte contém erros
